MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA204/mcu.h
/* TRISC */
#define _TRISC0 TRISCbits.TRISC0
#define _TRISC1 TRISCbits.TRISC1
#define _TRISC2 TRISCbits.TRISC2
#define _TRISC3 TRISCbits.TRISC3
#define _TRISC4 TRISCbits.TRISC4
#define _TRISC5 TRISCbits.TRISC5
#define _TRISC6 TRISCbits.TRISC6
#define _TRISC7 TRISCbits.TRISC7
#define _TRISC8 TRISCbits.TRISC8
#define _TRISC9 TRISCbits.TRISC9

/* PORTC */
#define _RC0 PORTCbits.RC0
#define _RC1 PORTCbits.RC1
#define _RC2 PORTCbits.RC2
#define _RC3 PORTCbits.RC3
#define _RC4 PORTCbits.RC4
#define _RC5 PORTCbits.RC5
#define _RC6 PORTCbits.RC6
#define _RC7 PORTCbits.RC7
#define _RC8 PORTCbits.RC8
#define _RC9 PORTCbits.RC9

/* LATC */
#define _LATC0 LATCbits.LATC0
#define _LATC1 LATCbits.LATC1
#define _LATC2 LATCbits.LATC2
#define _LATC3 LATCbits.LATC3
#define _LATC4 LATCbits.LATC4
#define _LATC5 LATCbits.LATC5
#define _LATC6 LATCbits.LATC6
#define _LATC7 LATCbits.LATC7
#define _LATC8 LATCbits.LATC8
#define _LATC9 LATCbits.LATC9

/* ODCC */
#define _ODC0 ODCCbits.ODC0
#define _ODC1 ODCCbits.ODC1
#define _ODC2 ODCCbits.ODC2
#define _ODC3 ODCCbits.ODC3
#define _ODC4 ODCCbits.ODC4
#define _ODC5 ODCCbits.ODC5
#define _ODC6 ODCCbits.ODC6
#define _ODC7 ODCCbits.ODC7
#define _ODC8 ODCCbits.ODC8
#define _ODC9 ODCCbits.ODC9

/* ANSC */
#define _ANSC0 ANSCbits.ANSC0
#define _ANSC1 ANSCbits.ANSC1
#define _ANSC2 ANSCbits.ANSC2
#define _ANSELC0 ANSCbits.ANSELC0
#define _ANSELC1 ANSCbits.ANSELC1
#define _ANSELC2 ANSCbits.ANSELC2

/* ANCFG */
#define _VBGEN ANCFGbits.VBGEN
#define _VBG2EN ANCFGbits.VBG2EN

/* PADCFG1 */
#define _PMPTTL PADCFG1bits.PMPTTL

/* CRYCON1 */
#define _CPHRMOD CRYCON1bits.CPHRMOD
#define _CPHRSEL CRYCON1bits.CPHRSEL
#define _OPMOD CRYCON1bits.OPMOD
#define _CRYGO CRYCON1bits.CRYGO
#define _FREEIE CRYCON1bits.FREEIE
#define _DONEIE CRYCON1bits.DONEIE
#define _ROLLIE CRYCON1bits.ROLLIE
#define _CRYSIDL CRYCON1bits.CRYSIDL
#define _CRYON CRYCON1bits.CRYON
#define _CPHRMOD0 CRYCON1bits.CPHRMOD0
#define _CPHRMOD1 CRYCON1bits.CPHRMOD1
#define _CPHRMOD2 CRYCON1bits.CPHRMOD2
#define _OPMOD0 CRYCON1bits.OPMOD0
#define _OPMOD1 CRYCON1bits.OPMOD1
#define _OPMOD2 CRYCON1bits.OPMOD2
#define _OPMOD3 CRYCON1bits.OPMOD3

/* CRYCON2 */
#define _KEYSRC CRYCON2bits.KEYSRC
#define _KEYMOD CRYCON2bits.KEYMOD
#define _SKEYSEL CRYCON2bits.SKEYSEL
#define _CTRSIZE CRYCON2bits.CTRSIZE
#define _KEYSRC0 CRYCON2bits.KEYSRC0
#define _KEYSRC1 CRYCON2bits.KEYSRC1
#define _KEYSRC2 CRYCON2bits.KEYSRC2
#define _KEYSRC3 CRYCON2bits.KEYSRC3
#define _KEYMOD0 CRYCON2bits.KEYMOD0
#define _KEYMOD1 CRYCON2bits.KEYMOD1
#define _CTRSIZE0 CRYCON2bits.CTRSIZE0
#define _CTRSIZE1 CRYCON2bits.CTRSIZE1
#define _CTRSIZE2 CRYCON2bits.CTRSIZE2
#define _CTRSIZE3 CRYCON2bits.CTRSIZE3
#define _CTRSIZE4 CRYCON2bits.CTRSIZE4
#define _CTRSIZE5 CRYCON2bits.CTRSIZE5
#define _CTRSIZE6 CRYCON2bits.CTRSIZE6

/* CRYSTAT */
#define _PGMFAIL CRYSTATbits.PGMFAIL
#define _KEYFAIL CRYSTATbits.KEYFAIL
#define _MODFAIL CRYSTATbits.MODFAIL
#define _ROLLOVR CRYSTATbits.ROLLOVR
#define _CRYABRT CRYSTATbits.CRYABRT
#define _TXTABSY CRYSTATbits.TXTABSY
#define _CRYBSY CRYSTATbits.CRYBSY

/* CRYOTP */
#define _CRYWR CRYOTPbits.CRYWR
#define _KEYPG CRYOTPbits.KEYPG
#define _CRYREAD CRYOTPbits.CRYREAD
#define _OTPIE CRYOTPbits.OTPIE
#define _PGMTST CRYOTPbits.PGMTST
#define _KEYPG0 CRYOTPbits.KEYPG0
#define _KEYPG1 CRYOTPbits.KEYPG1
#define _KEYPG2 CRYOTPbits.KEYPG2
#define _KEYPG3 CRYOTPbits.KEYPG3

/* AD1CON1 */
#define _DONE AD1CON1bits.DONE
#define _SAMP AD1CON1bits.SAMP
#define _ASAM AD1CON1bits.ASAM
#define _SSRC AD1CON1bits.SSRC
#define _FORM AD1CON1bits.FORM
#define _MODE12 AD1CON1bits.MODE12
/* Bitname _DMAEN cannot be defined because it is used by more than one SFR */
#define _DMABM AD1CON1bits.DMABM
#define _ADSIDL AD1CON1bits.ADSIDL
#define _ADON AD1CON1bits.ADON
#define _SSRC0 AD1CON1bits.SSRC0
#define _SSRC1 AD1CON1bits.SSRC1
#define _SSRC2 AD1CON1bits.SSRC2
#define _SSRC3 AD1CON1bits.SSRC3
#define _FORM0 AD1CON1bits.FORM0
#define _FORM1 AD1CON1bits.FORM1

/* AD1CON2 */
#define _ALTS AD1CON2bits.ALTS
#define _BUFM AD1CON2bits.BUFM
#define _SMPI AD1CON2bits.SMPI
#define _BUFS AD1CON2bits.BUFS
#define _CSCNA AD1CON2bits.CSCNA
#define _BUFREGEN AD1CON2bits.BUFREGEN
#define _OFFCAL AD1CON2bits.OFFCAL
#define _NVCFG0 AD1CON2bits.NVCFG0
#define _PVCFG AD1CON2bits.PVCFG
#define _SMPI0 AD1CON2bits.SMPI0
#define _SMPI1 AD1CON2bits.SMPI1
#define _SMPI2 AD1CON2bits.SMPI2
#define _SMPI3 AD1CON2bits.SMPI3
#define _SMPI4 AD1CON2bits.SMPI4
#define _PCVFG0 AD1CON2bits.PCVFG0
#define _PCVFG1 AD1CON2bits.PCVFG1

/* AD1CON3 */
#define _ADCS AD1CON3bits.ADCS
#define _SAMC AD1CON3bits.SAMC
#define _PUMPEN AD1CON3bits.PUMPEN
#define _EXTSAM AD1CON3bits.EXTSAM
#define _ADRC AD1CON3bits.ADRC
#define _ADCS0 AD1CON3bits.ADCS0
#define _ADCS1 AD1CON3bits.ADCS1
#define _ADCS2 AD1CON3bits.ADCS2
#define _ADCS3 AD1CON3bits.ADCS3
#define _ADCS4 AD1CON3bits.ADCS4
#define _ADCS5 AD1CON3bits.ADCS5
#define _ADCS6 AD1CON3bits.ADCS6
#define _ADCS7 AD1CON3bits.ADCS7
#define _SAMC0 AD1CON3bits.SAMC0
#define _SAMC1 AD1CON3bits.SAMC1
#define _SAMC2 AD1CON3bits.SAMC2
#define _SAMC3 AD1CON3bits.SAMC3
#define _SAMC4 AD1CON3bits.SAMC4

/* AD1CHS */
#define _CH0SA AD1CHSbits.CH0SA
#define _CH0NA AD1CHSbits.CH0NA
#define _CH0SB AD1CHSbits.CH0SB
#define _CH0NB AD1CHSbits.CH0NB
#define _CH0SA0 AD1CHSbits.CH0SA0
#define _CH0SA1 AD1CHSbits.CH0SA1
#define _CH0SA2 AD1CHSbits.CH0SA2
#define _CH0SA3 AD1CHSbits.CH0SA3
#define _CH0SA4 AD1CHSbits.CH0SA4
#define _CH0NA0 AD1CHSbits.CH0NA0
#define _CH0NA1 AD1CHSbits.CH0NA1
#define _CH0NA2 AD1CHSbits.CH0NA2
#define _CH0SB0 AD1CHSbits.CH0SB0
#define _CH0SB1 AD1CHSbits.CH0SB1
#define _CH0SB2 AD1CHSbits.CH0SB2
#define _CH0SB3 AD1CHSbits.CH0SB3
#define _CH0SB4 AD1CHSbits.CH0SB4
#define _CH0NB0 AD1CHSbits.CH0NB0
#define _CH0NB1 AD1CHSbits.CH0NB1
#define _CH0NB2 AD1CHSbits.CH0NB2

/* AD1CSSH */
#define _CSS27 AD1CSSHbits.CSS27
#define _CSS28 AD1CSSHbits.CSS28
#define _CSS29 AD1CSSHbits.CSS29
#define _CSS30 AD1CSSHbits.CSS30
#define _CSS31 AD1CSSHbits.CSS31

/* AD1CSSL */
#define _CSS0 AD1CSSLbits.CSS0
#define _CSS1 AD1CSSLbits.CSS1
#define _CSS2 AD1CSSLbits.CSS2
#define _CSS3 AD1CSSLbits.CSS3
#define _CSS4 AD1CSSLbits.CSS4
#define _CSS5 AD1CSSLbits.CSS5
#define _CSS6 AD1CSSLbits.CSS6
#define _CSS7 AD1CSSLbits.CSS7
#define _CSS8 AD1CSSLbits.CSS8
#define _CSS9 AD1CSSLbits.CSS9
#define _CSS10 AD1CSSLbits.CSS10
#define _CSS11 AD1CSSLbits.CSS11
#define _CSS12 AD1CSSLbits.CSS12
#define _CSS13 AD1CSSLbits.CSS13
#define _CSS14 AD1CSSLbits.CSS14

